app/controllers/items_controller.rb

INSERT INTO "items" ("updated_at", "todo_id", "body", "complete", "created_at") VALUES('2009-09-10 01:29:54', 1, 'Yes done', 'f', '2009-09-10 01:29:54')
---
  def create
    item = current_todo.items.create(:body => params[:body])

SELECT * FROM "items" WHERE ("items"."id" = 19 AND ("items".todo_id = 2))
UPDATE "items" SET "complete" = 'f', "updated_at" = '2009-09-10 03:32:27' WHERE "id" = 19
---
  def update_incomplete
    item = current_todo.items.find(params[:id])
    item.update_attribute(:complete, false)

SELECT * FROM "items" WHERE ("items"."id" = 19 AND ("items".todo_id = 2))
UPDATE "items" SET "complete" = 't', "updated_at" = '2009-09-10 03:31:36' WHERE "id" = 19
---
  def update_complete
    item = current_todo.items.find(params[:id])
    item.update_attribute(:complete, true)