app/controllers/todos_controller.rb

  def index
    todo = Todo.create!
---
INSERT INTO "todos" ("updated_at", "token", "ip", "agent", "created_at") VALUES('2009-09-10 00:55:10', '65v9qg', NULL, NULL, '2009-09-10 00:55:10')

  def show
    @todo = Todo.find_by_token(params[:id])
---
SELECT * FROM "todos" WHERE ("todos"."token" = '65v9qg') LIMIT 1